config.org
#+AUTHOR: Terencio Agozzino
#+TITLE: GNU Emacs Configuration

* Table of Content                                                    :TOC:
- [[#about][About]]
- [[#emacs-initialization][Emacs Initialization]]
  - [[#packages-sources][Packages Sources]]
  - [[#use-package][use-package]]
- [[#start-up][Start Up]]
  - [[#authentification][Authentification]]
  - [[#customization][Customization]]
  - [[#theme][Theme]]
  - [[#turn-off-mouse-interface][Turn off mouse interface]]
  - [[#use-better-defaults][Use better defaults]]
- [[#programming-languages][Programming Languages]]
  - [[#css][CSS]]
  - [[#docker][Docker]]
  - [[#emacs-lisp][Emacs Lisp]]
  - [[#java][Java]]
  - [[#javascript][JavaScript]]
  - [[#latex][LaTeX]]
  - [[#lua][Lua]]
  - [[#markdown][Markdown]]
  - [[#php][PHP]]
  - [[#python][Python]]
  - [[#sql][SQL]]
  - [[#yaml][YAML]]
- [[#advanced-configuration][Advanced Configuration]]
  - [[#abbreviations][Abbreviations]]
  - [[#alert][Alert]]
  - [[#auto-completion][Auto-Completion]]
  - [[#backups][Backups]]
  - [[#dashboard][Dashboard]]
  - [[#history][History]]
  - [[#hydra][Hydra]]
  - [[#irc][IRC]]
  - [[#ivy][Ivy]]
  - [[#lorem-ipsum][Lorem Ipsum]]
  - [[#mail][Mail]]
  - [[#paste][Paste]]
  - [[#pdf][PDF]]
  - [[#point-and-region][Point and Region]]
  - [[#projectile][Projectile]]
  - [[#spotify][Spotify]]
  - [[#version-control][Version Control]]
  - [[#word-wrap][Word Wrap]]
  - [[#clean-white-spaces-after-saving][Clean white spaces after saving]]
  - [[#ending-up][Ending up]]
  - [[#killing-text][Killing text]]
  - [[#ibuffer][=Ibuffer=]]
  - [[#replace-the-current-file-with-the-saved-one][Replace the current file with the saved one]]
  - [[#specific-a-command-after-saved-file][Specific a command after saved file]]
- [[#navigation][Navigation]]
  - [[#chromium-as-default-browser][Chromium as default browser]]
  - [[#copy-filename-to-clipboard][Copy filename to clipboard]]
  - [[#engine-mode][=engine-mode=]]
  - [[#find-dired][=find-dired=]]
  - [[#frequently-accessed-files][Frequently-accessed files]]
  - [[#move-text][=move-text=]]
  - [[#move-to-beginning-of-line][Move to beginning of line]]
  - [[#pop-to-mark][Pop to mark]]
  - [[#recentf][=recentf=]]
  - [[#switch-window][=switch-window=]]
  - [[#windmove][=windmove=]]
- [[#org-mode][Org-Mode]]
  - [[#basic-configuration][Basic configuration]]
  - [[#files][Files]]
  - [[#keyboard-shortcuts][Keyboard shortcuts]]
  - [[#languages][Languages]]
  - [[#modules][Modules]]
  - [[#speed-commands][Speed commands]]
  - [[#move-line][Move line]]
- [[#org-agenda][Org Agenda]]
  - [[#basic-configuration-1][Basic configuration]]
  - [[#archiving][Archiving]]
  - [[#capture][Capture]]
  - [[#custom-commands][Custom commands]]
  - [[#habits][Habits]]
  - [[#projects][Projects]]
  - [[#refiling][Refiling]]
  - [[#tags][Tags]]
  - [[#time][Time]]
  - [[#tracking][Tracking]]
  - [[#further][Further]]
- [[#journal][Journal]]
  - [[#encryptiondecryption][Encryption/Decryption]]
  - [[#revealjs][Reveal.js]]
- [[#plugins-configuration][Plugins configuration]]
  - [[#aggressive-indent][=aggressive-indent=]]
  - [[#atomic-chrome][=atomic chrome=]]
  - [[#calc][=calc=]]
  - [[#which-key][=which-key=]]
  - [[#flycheck][=flycheck=]]
  - [[#hungry-delete][=hungry-delete=]]
  - [[#iedit][=iedit=]]
  - [[#ipcalc][=ipcalc=]]
  - [[#ledger][=ledger=]]
  - [[#rainbow-mode][=rainbow-mode=]]
  - [[#skewer-mode][=skewer-mode=]]
  - [[#swiper][=swiper=]]
  - [[#impatient-mode][=impatient-mode=]]
  - [[#smartparens][=smartparens=]]
  - [[#try][=try=]]
  - [[#undo-tree][=undo-tree=]]
  - [[#web-beautify][=web-beautify=]]
  - [[#web-mode][=web-mode=]]
  - [[#key-chord][=key-chord=]]
  - [[#winner][=winner=]]
  - [[#yasnippet][=yasnippet=]]

* About

After using GNU Emacs for a while, I decided to create my own config to simplify
my daily life by adding scripts, useful functions, etc.

For more informations about myself, you can visit my [[http://terencio-agozzino.com/][website]].

To manage package configurations, I use the [[https://github.com/jwiegley/use-package/][use-package]] package from John
Wiegley, that I recommend.

This configuration is mainly based on the following user configurations:
- [[https://github.com/jwiegley/dot-emacs/][John Wiegley]] (=jwiegley=)
- [[https://github.com/sachac][Sacha Chua]] (=sachac=)
- [[https://github.com/angrybacon/dotemacs][Mathieu Marques]] (=angrybacon=)

Thanks to them for their incredible work!

* Emacs Initialization

** Packages Sources

In order to install packages, it is useful to configure the package sources.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t)
  (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
#+END_SRC

** use-package

To be able to manage its configuration with =use-package= it is necessary to
first install it, if you don't already.

#+BEGIN_SRC emacs-lisp :tangle yes
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (require 'diminish)
#+END_SRC

* Start Up

** Authentification

I put my =.authinfo.gpg= file in [[https://github.com/syncthing/syncthing][Syncthing]] in order to be able to easily use my
configuration on other devices.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq auth-sources '("~/Sync/shared/.authinfo.gpg"
                       "~/.authinfo.gpg"
                       "~/.authinfo"
                       "~/.netrc"))
#+END_SRC

** Customization

To avoid overloading the GNU Emacs custormization =init.el= file made by the
user with the UI, I add the generated code in a separate file.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq-default custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file t))
#+END_SRC

** Theme

I like the light on dark because I find it to be more restful.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package solarized-theme
    :defer 1
    :init
    (load-theme 'solarized-dark t))

  (use-package smart-mode-line
    :defer 1
    :config
    (setq sml/theme 'respectful)
    (sml/setup))
#+END_SRC

** Turn off mouse interface

Since I never use the mouse with GNU Emacs, I prefer not to use certain
graphical elements as seen as the menu bar, toolbar, scrollbar and tooltip that
I find invasive.

#+BEGIN_SRC emacs-lisp :tangle yes
  (when window-system
    (menu-bar-mode -1)                              ; Disable the menu bar
    (scroll-bar-mode -1)                            ; Disable the scroll bar
    (tool-bar-mode -1)                              ; Disable the tool bar
    (tooltip-mode -1))                              ; Disable the tooltips
#+END_SRC

** Use better defaults

For a better user experience of GNU Emacs, here are the default values I use.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq-default
   cursor-in-non-selected-windows t                 ; Hide the cursor in inactive windows
   display-time-default-load-average nil            ; Don't display load average
   fill-column 80                                   ; Set width for automatic line breaks
   help-window-select t                             ; Focus new help windows when opened
   inhibit-startup-screen t                         ; Disable start-up screen
   initial-scratch-message ""                       ; Empty the initial *scratch* buffer
   load-prefer-newer t                              ; Prefers the newest version of a file
   scroll-conservatively most-positive-fixnum       ; Always scroll by one line
   select-enable-clipboard t                        ; Merge system's and Emacs' clipboard
   tab-width 4                                      ; Set width for tabs
   user-full-name "Terencio Agozzino"               ; Set the full name of the current user
   user-mail-address "terencio.agozzino@gmail.com"  ; Set the email address of the current user
   use-package-always-ensure t)                     ; Avoid the :ensure keyword for each package
  (cd "~/")                                         ; Move to the user directory
  (column-number-mode 1)                            ; Show the column number
  (display-time-mode 1)                             ; Enable time in the mode-line
  (fset 'yes-or-no-p 'y-or-n-p)                     ; Replace yes/no prompts with y/n
  (global-hl-line-mode)                             ; Hightlight current line
  (show-paren-mode 1)                               ; Show the parent
#+END_SRC

* Programming Languages

** CSS

*** =emmet-mode=

Powerful minor mode to produce HTML from CSS-like selector.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package emmet-mode
    :defer 6
    :hook (sgml-mode css-mode web-mode))
#+END_SRC

*** =less-css-mode=

Awesome package to programming in LESS.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package less-css-mode
    :mode "\\.less\\'"
    :interpreter ("less" . less-css-mode))
#+END_SRC

** Docker

I like to use Docker when I need to install various databases or other services
that only work on a particular operating system while keeping my operating
system clean.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package dockerfile-mode
    :mode "Dockerfile\\'")
#+END_SRC

** Emacs Lisp

*** Eldoc

Provides minibuffer hints when working with Emacs Lisp.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package "eldoc"
    :hook (emacs-lisp-mode . eldoc-mode))
#+END_SRC

** Java

Configuring Java for GNU Emacs is very simple with =eclim=. All you need to do is
install =Eclipse= and =eclim=.

*** Eclim

#+BEGIN_QUOTE
Eclim is an Eclipse plugin which exposes Eclipse features through a server
interface. When this server is started, the command line utility eclim can be
used to issue requests to that server.

[[https://github.com/senny/emacs-eclim][James Chochlinski]]
#+END_QUOTE

To use this plugin, you must download =eclim= with the Java Jar file as
installer and put the executables =eclim= and =eclimd= in the same folder where
you installed =Eclipse= (in my case, =/opt/eclipse=).

Now all that remains is to configure =eclim=:

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package eclim
    :defer 3
    :hook (java-mode . eclim-mode)
    :custom
    (eclimd-autostart t)
    (eclimd-default-workspace '"~/Documents/Projects/Java/")
    (eclim-eclipse-dirs '"/opt/eclipse")
    (eclim-executable '"/opt/eclipse/eclim")
    (help-at-pt-display-when-idle t)
    (help-at-pt-timer-delay 0.1)
    (help-at-pt-set-timer))
#+END_SRC

*** =company-emacs-eclim=

=eclim= backend for =company-mode=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company-emacs-eclim
    :after (company eclim)
    :commands company-emacs-eclim-setup)
#+END_SRC

*** Gradle

Most of my Java projects are made with =gradle=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package gradle-mode
    :mode "\\.gradle\\'"
    :interpreter ("gradle" . gradle-mode))
#+END_SRC

** JavaScript

For my JavaScript configuration, I took my sources from the Nicolas Petton's
blog which I found very well explained.

[[https://emacs.cafe/emacs/javascript/setup/2017/04/23/emacs-setup-javascript.html][Setting up Emacs for JavaScript (part #1)]]
[[https://emacs.cafe/emacs/javascript/setup/2017/05/09/emacs-setup-javascript-2.html][Setting up Emacs for JavaScript (part #2)]]

*** =js2-mode2=

By default, GNU Emacs uses =js-mode= as major mode for JavaScript buffers and I
prefer use =js2-mode= instead because of his abilities to parses buffers and
builds an AST for things like syntax highlighting.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package js2-mode
    :defer 5
    :hook (js2-mode . js2-imenu-extras-mode)
    :mode "\\.js\\'")
#+END_SRC

