config.el
(add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t)
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'diminish)

(setq auth-sources '("~/Sync/shared/.authinfo.gpg"
                     "~/.authinfo.gpg"
                     "~/.authinfo"
                     "~/.netrc"))

(setq-default custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file t))

(use-package solarized-theme
  :defer 1
  :init
  (load-theme 'solarized-dark t))

(use-package smart-mode-line
  :defer 1
  :config
  (setq sml/theme 'respectful)
  (sml/setup))

(when window-system
  (menu-bar-mode -1)                              ; Disable the menu bar
  (scroll-bar-mode -1)                            ; Disable the scroll bar
  (tool-bar-mode -1)                              ; Disable the tool bar
  (tooltip-mode -1))                              ; Disable the tooltips

(setq-default
 cursor-in-non-selected-windows t                 ; Hide the cursor in inactive windows
 display-time-default-load-average nil            ; Don't display load average
 fill-column 80                                   ; Set width for automatic line breaks
 help-window-select t                             ; Focus new help windows when opened
 inhibit-startup-screen t                         ; Disable start-up screen
 initial-scratch-message ""                       ; Empty the initial *scratch* buffer
 load-prefer-newer t                              ; Prefers the newest version of a file
 scroll-conservatively most-positive-fixnum       ; Always scroll by one line
 select-enable-clipboard t                        ; Merge system's and Emacs' clipboard
 tab-width 4                                      ; Set width for tabs
 user-full-name "Terencio Agozzino"               ; Set the full name of the current user
 user-mail-address "terencio.agozzino@gmail.com"  ; Set the email address of the current user
 use-package-always-ensure t)                     ; Avoid the :ensure keyword for each package
(cd "~/")                                         ; Move to the user directory
(column-number-mode 1)                            ; Show the column number
(display-time-mode 1)                             ; Enable time in the mode-line
(fset 'yes-or-no-p 'y-or-n-p)                     ; Replace yes/no prompts with y/n
(global-hl-line-mode)                             ; Hightlight current line
(show-paren-mode 1)                               ; Show the parent

(use-package emmet-mode
  :defer 6
  :hook (sgml-mode css-mode web-mode))

(use-package less-css-mode
  :mode "\\.less\\'"
  :interpreter ("less" . less-css-mode))

(use-package dockerfile-mode
  :mode "Dockerfile\\'")

(use-package "eldoc"
  :hook (emacs-lisp-mode . eldoc-mode))

(use-package eclim
  :defer 3
  :hook (java-mode . eclim-mode)
  :custom
  (eclimd-autostart t)
  (eclimd-default-workspace '"~/Documents/Projects/Java/")
  (eclim-eclipse-dirs '"/opt/eclipse")
  (eclim-executable '"/opt/eclipse/eclim")
  (help-at-pt-display-when-idle t)
  (help-at-pt-timer-delay 0.1)
  (help-at-pt-set-timer))

(use-package company-emacs-eclim
  :after (company eclim)
  :commands company-emacs-eclim-setup)

(use-package gradle-mode
  :mode "\\.gradle\\'"
  :interpreter ("gradle" . gradle-mode))

(use-package js2-mode
  :defer 5
  :hook (js2-mode . js2-imenu-extras-mode)
  :mode "\\.js\\'")
