config.org
*** =js2-refactor=

Provides powerful refactoring based on the AST generated by =js2-mode=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package js2-refactor
    :defer 5
    :bind (:map js2-mode-map
                ("C-k" . js2r-kill)
                ("M-." . nil))
    :hook ((js2-mode . js2-refactor-mode)
           (js2-mode . (lambda ()
                        (add-hook 'xref-backend-functions #'xref-js2-xref-backend nil t))))
    :config
    (js2r-add-keybindings-with-prefix "C-c C-r"))
#+END_SRC

*** =xref-js2=

Makes it easy to jump to function references or definitions.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package xref-js2
    :defer 5)
#+END_SRC

*** =tern=

Parses JavaScript files in a project and makes type inference to provide
meaningful completion (with type clues) and cross-reference support.

Unfortunately, =tern= has some problems with cross-references that explain why I am
using =xref-js2= instead.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package tern
    :defer 5
    :bind (("C-c C-c" . compile)
           :map tern-mode-keymap
           ("M-." . nil))
    :hook ((js2-mode . company-mode)
           (js2-mode . tern-mode)))
#+END_SRC

If you plan to use it, don't forget to install it via =npm=:

#+BEGIN_SRC bash :tangle yes
  sudo npm install -g tern
#+END_SRC

Then, add a =.tern-project= file to the root of your project.

Here is an example configuration for a project that uses =requirejs= and =jQuery=, without taking into account
of the =bower_components= directory:

#+BEGIN_SRC json
  {
      "libs": [
          "jquery"
      ],
      "loadEagerly": [
          "./**/*.js"
      ],
      "dontLoad": [
          "./bower_components/"
      ],
      "plugins": {
          "requirejs": {
              "baseURL": "./"
          }
      }
  }
#+END_SRC

*** =company-tern=

=tern= backend for =company-mode=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company-tern
    :after (company tern)
    :config (add-to-list 'company-backends 'company-tern))
#+END_SRC

** LaTeX

I use LaTeX for my reports, CVs, summaries, etc.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package tex
    :ensure auctex
    :hook ((LaTeX-mode . flyspell-mode)
           (LaTeX-mode . reftex-mode))
    :custom
    (TeX-PDF-mode t)
    (TeX-auto-save t)
    (TeX-byte-compile t)
    (TeX-clean-confirm nil)
    (TeX-master 'dwim)
    (TeX-parse-self t)
    (TeX-source-correlate-mode t)
    (TeX-view-program-selection '((output-pdf "Evince")
                                  (output-html "xdg-open"))))
#+END_SRC

I want a TeX engine that can deal with Unicode and use any font I like.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq-default TeX-engine 'xetex)
#+END_SRC

*** =company-auctex=

AUCTeX backend for company-mode.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company-auctex
    :after (auctex company)
    :config
    (company-auctex-init))
#+END_SRC

*** =reftex=

Minor mode with distinct support for \label, \ref and \cite in LaTeX.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package reftex
    :after auctex)
#+END_SRC

** Lua

I rarely program in Lua, but when I do, =lua-mode= satisfies me amply.2

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package lua-mode
    :mode "\\.lua\\'"
    :interpreter ("lua" . lua-mode))
#+END_SRC

** Markdown

Before you can use this package, make sure you install =markdown= on your
operating system.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package markdown-mode
    :mode
    ("INSTALL\\'"
     "CONTRIBUTORS\\'"
     "LICENSE\\'"
     "README\\'"
     "\\.markdown\\'"
     "\\.md\\'"))
#+END_SRC

** PHP

For people who wonder, I don't use =php-mode= for its lack of indentation for
PHP inside the HTML divs. Also, why use another package when =web-mode= already
provides everything I need?

The function below provides my own PHP configuration with =flycheck=.


#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/php-setup ()
    (web-mode)

    (make-local-variable 'web-mode-code-indent-offset)
    (make-local-variable 'web-mode-markup-indent-offset)
    (make-local-variable 'web-mode-css-indent-offset)

    (setq web-mode-css-indent-offset 2)
    (setq web-mode-code-indent-offset 4)
    (setq web-mode-markup-indent-offset 2)

    (flycheck-select-checker 'my-php)
    (flycheck-mode t))
#+END_SRC

Don't forget to add the following line in the =web-mode= package configuration:

#+BEGIN_EXAMPLE
  (add-to-list 'auto-mode-alist '("\\.php$" . my/php-setup))
#+END_EXAMPLE

I like using =ac-php= to enable GNU Emacs auto-completion for PHP. Note that
=ac-php= supports =company mode= and =auto-complete=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package ac-php
    :after php-mode
    :hook (php-mode . ac-php-mode)
    :custom
    (ac-sources '(ac-source-php))
    :config
    (auto-complete-mode t)
    (ac-php-core-eldoc-setup))
#+END_SRC

** Python

I prefer to use =anaconda-mode= which I find easier to configure, because it
supports =company-mode= better than =jedi= which is quite old.

*** =anaconda-mode=

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package anaconda-mode
    :after python
    :hook ((anaconda-mode anaconda-eldoc-mode) . python-mode))
#+END_SRC

*** =company-anaconda=

Anaconda backend for =company-mode=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company-anaconda
    :after (anaconda-mode company)
    :config
    (add-to-list 'company-backends 'company-anaconda))
#+END_SRC

** SQL

=sql-indent= gives me the possibility to easily manage =.sql= files.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package sql-indent
    :mode "\\.sql\\'"
    :interpreter ("sql" . sql-mode))
#+END_SRC

** YAML

=yaml-mode= gives me the possibility to easily manage =.yml= files.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package yaml-mode
    :mode "\\.yml\\'"
    :interpreter ("yml" . yml-mode))
#+END_SRC

* Advanced Configuration

** Abbreviations

According to a list of misspelled words, =abbrev= auto-correct these words on
the fly.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package abbrev
    :defer 2
    :ensure nil
    :diminish abbrev-mode
    :config
    (if (file-exists-p abbrev-file-name)
        (quietly-read-abbrev-file)))
#+END_SRC

** Alert

Most packages use =alerts= to make notifications with =libnotify=. Don't forget
to first install a notification daemon, like =dunst=.

#+BEGIN_QUOTE
Alert is a Growl-workalike for Emacs which uses a common notification interface
and multiple, selectable "styles", whose use is fully customizable by the user.

[[https://github.com/jwiegley/alert][John Wiegley]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package alert
    :custom
    (alert-default-style 'libnotify))
#+END_SRC

** Auto-Completion

=company= provides auto-completion at point and to Displays a small pop-in
containing the candidates.

#+BEGIN_QUOTE
Company is a text completion framework for Emacs. The name stands for "complete
anything". It uses pluggable back-ends and front-ends to retrieve and display
completion candidates.

[[http://company-mode.github.io/][Dmitry Gutov]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company
    :defer 2
    :diminish
    :custom
    (company-begin-commands '(self-insert-command))
    (company-idle-delay .1)
    (company-minimum-prefix-length 2)
    (company-show-numbers t)
    (company-tooltip-align-annotations 't)
    (global-company-mode t))
#+END_SRC

I use =company= with =company-box= that allows a company front-end with icons.

#+BEGIN_SRC emacs-lisp :tangle yes
   (use-package company-box
     :after company
     :diminish
     :hook (company-mode . company-box-mode))
#+END_SRC

** Backups

It is important to have a stable backup environment. Don't hesitate to save a
lot.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package files
	:ensure nil
	:custom
	(backup-directory-alist `(("." . ,(expand-file-name "backups/" user-emacs-directory))))
	(delete-old-versions -1)
	(vc-make-backup-files t)
	(version-control t))
#+END_SRC

** Dashboard

Always good to have a dashboard.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package dashboard
    :preface
    (defun my/dashboard-banner ()
      "Set a dashboard banner including information on package initialization
     time and garbage collections."""
      (setq dashboard-banner-logo-title
            (format "Emacs ready in %.2f seconds with %d garbage collections."
                    (float-time (time-subtract after-init-time before-init-time)) gcs-done)))
    :init
    (add-hook 'after-init-hook 'dashboard-refresh-buffer)
    (add-hook 'dashboard-mode-hook 'my/dashboard-banner)
    :config
    (setq dashboard-startup-banner 'logo)
    (dashboard-setup-startup-hook))
#+END_SRC

** History

Provides the ability to have commands and their history saved so that whenever
you return to work, you can re-run things as you need them. This is not a
radical function, it is part of a good user experience.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq history-delete-duplicates t)
  (setq history-length t)
  (setq savehist-additional-variables
        '(kill-ring
          search-ring
          regexp-search-ring))
  (setq savehist-file (expand-file-name "history" user-emacs-directory))
  (setq savehist-save-minibuffer-history 1)
  (savehist-mode 1)
#+END_SRC

** Hydra

Hydra allows me to display a list of all the commands implemented in the echo
area and easily interact with them.

#+BEGIN_QUOTE
Once you summon the Hydra through the prefixed binding (the body + any one
head), all heads can be called in succession with only a short extension.

The Hydra is vanquished once Hercules, any binding that isn't the Hydra's head,
arrives. Note that Hercules, besides vanquishing the Hydra, will still serve his
original purpose, calling his proper command. This makes the Hydra very
seamless, it's like a minor mode that disables itself auto-magically.

[[https://github.com/abo-abo/hydra][Oleh Krehel]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package hydra
    :defer 2
    :bind ("C-c f" . hydra-flycheck/body)
          ("C-c m" . hydra-magit/body)
          ("C-c p" . hydra-projectile/body)
          ("C-c o" . hydra-toggle/body)
          ("C-c w" . hydra-windows/body))
#+END_SRC

