config.el

(use-package js2-refactor
  :defer 5
  :bind (:map js2-mode-map
              ("C-k" . js2r-kill)
              ("M-." . nil))
  :hook ((js2-mode . js2-refactor-mode)
         (js2-mode . (lambda ()
                      (add-hook 'xref-backend-functions #'xref-js2-xref-backend nil t))))
  :config
  (js2r-add-keybindings-with-prefix "C-c C-r"))

(use-package xref-js2
  :defer 5)

(use-package tern
  :defer 5
  :bind (("C-c C-c" . compile)
         :map tern-mode-keymap
         ("M-." . nil))
  :hook ((js2-mode . company-mode)
         (js2-mode . tern-mode)))

(use-package company-tern
  :after (company tern)
  :config (add-to-list 'company-backends 'company-tern))

(use-package tex
  :ensure auctex
  :hook ((LaTeX-mode . flyspell-mode)
         (LaTeX-mode . reftex-mode))
  :custom
  (TeX-PDF-mode t)
  (TeX-auto-save t)
  (TeX-byte-compile t)
  (TeX-clean-confirm nil)
  (TeX-master 'dwim)
  (TeX-parse-self t)
  (TeX-source-correlate-mode t)
  (TeX-view-program-selection '((output-pdf "Evince")
                                (output-html "xdg-open"))))

(setq-default TeX-engine 'xetex)

(use-package company-auctex
  :after (auctex company)
  :config
  (company-auctex-init))

(use-package reftex
  :after auctex)

(use-package lua-mode
  :mode "\\.lua\\'"
  :interpreter ("lua" . lua-mode))

(use-package markdown-mode
  :mode
  ("INSTALL\\'"
   "CONTRIBUTORS\\'"
   "LICENSE\\'"
   "README\\'"
   "\\.markdown\\'"
   "\\.md\\'"))

(defun my/php-setup ()
  (web-mode)

  (make-local-variable 'web-mode-code-indent-offset)
  (make-local-variable 'web-mode-markup-indent-offset)
  (make-local-variable 'web-mode-css-indent-offset)

  (setq web-mode-css-indent-offset 2)
  (setq web-mode-code-indent-offset 4)
  (setq web-mode-markup-indent-offset 2)

  (flycheck-select-checker 'my-php)
  (flycheck-mode t))

(use-package ac-php
  :after php-mode
  :hook (php-mode . ac-php-mode)
  :custom
  (ac-sources '(ac-source-php))
  :config
  (auto-complete-mode t)
  (ac-php-core-eldoc-setup))

(use-package anaconda-mode
  :after python
  :hook ((anaconda-mode anaconda-eldoc-mode) . python-mode))

(use-package company-anaconda
  :after (anaconda-mode company)
  :config
  (add-to-list 'company-backends 'company-anaconda))

(use-package sql-indent
  :mode "\\.sql\\'"
  :interpreter ("sql" . sql-mode))

(use-package yaml-mode
  :mode "\\.yml\\'"
  :interpreter ("yml" . yml-mode))

(use-package abbrev
  :defer 2
  :ensure nil
  :diminish abbrev-mode
  :config
  (if (file-exists-p abbrev-file-name)
      (quietly-read-abbrev-file)))

(use-package alert
  :custom
  (alert-default-style 'libnotify))

(use-package company
  :defer 2
  :diminish
  :custom
  (company-begin-commands '(self-insert-command))
  (company-idle-delay .1)
  (company-minimum-prefix-length 2)
  (company-show-numbers t)
  (company-tooltip-align-annotations 't)
  (global-company-mode t))

(use-package company-box
  :after company
  :diminish
  :hook (company-mode . company-box-mode))

(use-package files
      :ensure nil
      :custom
      (backup-directory-alist `(("." . ,(expand-file-name "backups/" user-emacs-directory))))
      (delete-old-versions -1)
      (vc-make-backup-files t)
      (version-control t))

(use-package dashboard
  :preface
  (defun my/dashboard-banner ()
    "Set a dashboard banner including information on package initialization
   time and garbage collections."""
    (setq dashboard-banner-logo-title
          (format "Emacs ready in %.2f seconds with %d garbage collections."
                  (float-time (time-subtract after-init-time before-init-time)) gcs-done)))
  :init
  (add-hook 'after-init-hook 'dashboard-refresh-buffer)
  (add-hook 'dashboard-mode-hook 'my/dashboard-banner)
  :config
  (setq dashboard-startup-banner 'logo)
  (dashboard-setup-startup-hook))

(setq history-delete-duplicates t)
(setq history-length t)
(setq savehist-additional-variables
      '(kill-ring
        search-ring
        regexp-search-ring))
(setq savehist-file (expand-file-name "history" user-emacs-directory))
(setq savehist-save-minibuffer-history 1)
(savehist-mode 1)

(use-package hydra
  :defer 2
  :bind ("C-c f" . hydra-flycheck/body)
        ("C-c m" . hydra-magit/body)
        ("C-c p" . hydra-projectile/body)
        ("C-c o" . hydra-toggle/body)
        ("C-c w" . hydra-windows/body))
