config.org
*** mu4e

Before you can use this configuration, make sure you install =mu= on your
operating system and create directories corresponding to those in your mailbox.

Now all that remains is to configure =mu4e=:

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package mu4e
    :ensure nil
    :custom
    (mu4e-attachment-dir "~/Downloads")
    (mu4e-compose-signature-auto-include nil)
    (mu4e-drafts-folder "/gmail/Drafts")
    (mu4e-get-mail-command "mbsync -a")
    (mu4e-maildir "~/Maildir")
    (mu4e-maildir-shortcuts
     '(("/gmail/INBOX" . ?i)
       ("/gmail/All Mail" . ?a)
       ("/gmail/Deleted Items" . ?d)
       ("/gmail/Drafts" . ?D)
       ("/gmail/Important" . ?i)
       ("/gmail/Sent Mail" . ?s)
       ("/gmail/Starred" . ?S)))
    (mu4e-refile-folder "/gmail/Archive")
    (mu4e-sent-folder "/gmail/Sent Mail")
    (mu4e-trash-folder "/gmail/Trash")
    (mu4e-update-interval 300)
    (mu4e-use-fancy-chars t)
    (mu4e-view-show-addresses t)
    (mu4e-view-show-images t))
#+END_SRC

Being able to read mails is a good thing, but being notified when we receive
mails is better! The following few lines allow you to receive desktop
notifications and modeline display for =mu4e=:

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package mu4e-alert
    :after mu4e
    :hook ((after-init . mu4e-alert-enable-mode-line-display)
           (after-init . mu4e-alert-enable-notifications))
    :config
    (mu4e-alert-set-default-style 'libnotify))
#+END_SRC

*** Sending Mail

For you can send mails, create the =.authinfo= file if it is not already
done. Then add the following two lines replacing /terencio.agozzino/ (which
corresponds to my gmail address terencio.agozzino@gmail.com without the domain
name) and /<password>/ by those that match your real information:

#+BEGIN_EXAMPLE
  machine imap.gmail.com login terencio.agozzino password <password> port 993
  machine smtp.gmail.com login terencio.agozzino password <password> port 465
#+END_EXAMPLE

Similar to IRC, if you want to store your password in a /GPG/ file, you just
need to specify a file priority list with =auth-sources=, to tell GNU Emacs
where to start looking for your password first.

Then encrypt that file with =gpg -c .authinfo= and don't forget to delete the
=.authinfo= file.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq send-mail-function 'smtpmail-send-it
        smtpmail-smtp-server "smtp.gmail.com"
        smtpmail-smtp-service 465
        smtpmail-stream-type 'ssl)
#+END_SRC

All you need now is to test sending your mails with =C-x m= or directly from
=mu4e=!

** Paste

#+BEGIN_QUOTE
This mode allows to paste whole buffers or parts of buffers to pastebin-like
services. It supports more than one service and will failover if one service
fails.

[[https://github.com/etu/webpaste.el][Elis Hirwing]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package webpaste
    :defer 3
    :bind (("C-c C-p C-b" . webpaste-paste-buffer)
           ("C-c C-p C-r" . webpaste-paste-region)))
#+END_SRC

** PDF

#+BEGIN_QUOTE
PDF Tools is, among other things, a replacement of DocView for PDF files. The
key difference is that pages are not pre-rendered by e.g. ghostscript and stored
in the file-system, but rather created on-demand and stored in memory.

[[https://github.com/politza/pdf-tools][Andras Politz]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package pdf-tools
    :defer 1
    :init
    (pdf-tools-install)
    :custom
    (pdf-view-use-unicode-ligther nil))
#+END_SRC

** Point and Region

Increase region by semantic units. It tries to be smart about it and adapt to
the structure of the current major mode.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package expand-region
    :defer 2
    :bind (("C-+" . er/contract-region)
           ("C-=" . er/expand-region)))
#+END_SRC


** Projectile

#+BEGIN_QUOTE
Projectile is a project interaction library for Emacs. Its goal is to provide a
nice set of features operating on a project level without introducing external
dependencies (when feasible). For instance - finding project files has a
portable implementation written in pure Emacs Lisp without the use of GNU find
(but for performance sake an indexing mechanism backed by external commands
exists as well).

[[https://github.com/bbatsov/projectile][Bozhidar Batsov]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package projectile
    :defer 1
    :custom
    (projectile-cache-file (expand-file-name ".projectile-cache" user-emacs-directory)
    (projectile-completion-system 'ivy)
    (projectile-enable-caching t)
    (projectile-known-projects-file (expand-file-name
                                   ".projectile-bookmarks" user-emacs-directory))
    (projectile-mode-line '(:eval (projectile-project-name)))
    :config
    (define-key projectile-mode-map (kbd "C-c p") #'hydra-projectile/body)
    (projectile-global-mode)))
#+END_SRC

** Spotify

Control the spotify application from GNU Emacs.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package spotify
    :defer 5
    :config
    (spotify-enable-song-notifications))
#+END_SRC

** Version Control

It is quite common to work on Git repositories, so it is important to have a
configuration that we like.

#+BEGIN_QUOTE
[[https://github.com/magit/magit][Magit]] is an interface to the version control system Git, implemented as an Emacs
package. Magit aspires to be a complete Git porcelain. While we cannot (yet)
claim that Magit wraps and improves upon each and every Git command, it is
complete enough to allow even experienced Git users to perform almost all of
their daily version control tasks directly from within Emacs. While many fine
Git clients exist, only Magit and Git itself deserve to be called porcelains.

[[https://github.com/tarsius][Jonas Bernoulli]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package git-commit
	:after magit
	:hook (git-commit-mode . me/git-commit-auto-fill-everywhere)
	:custom
	(git-commit-summary-max-length 50)
	:preface
	(defun me/git-commit-auto-fill-everywhere ()
	  (setq fill-column 72)
	  (setq-local comment-auto-fill-only-comments nil)))

  (use-package magit
	:defer 2)
#+END_SRC

In addition to that, I like to see the lines that are being modified in the file
while it is being edited.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package git-gutter
    :defer 2
    :diminish
    :init
    (global-git-gutter-mode +1))
#+END_SRC

Finally, one last package that I like to use with Git to easily see the changes
made by previous commits.

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package git-timemachine
  :defer 3
  :diminish)
#+END_SRC

** Word Wrap

I like to have lines of the same length.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package simple
    :ensure nil
    :hook ((prog-mode . turn-on-auto-fill)
           (text-mode . turn-on-auto-fill)))
#+END_SRC

** Clean white spaces after saving

It's often annoying to see useless white spaces at the end of a line or a file.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
#+END_SRC

** Ending up

I'm using a =.org= file to maintain my GNU Emacs config. However, at his launch,
he will loads the =config.el= source file for a faster loading.

The code below, automatic executes =org-babel-tangle= asynchronously when
config.org is saved.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package async)
  (use-package org
    :defer 1
    :hook (after-save . my/config-tangle)
    :config
    (defvar *config-file* "~/.emacs.d/config.org"
      "The configuration file.")

    (defvar *config-last-change* (nth 5 (file-attributes *config-file*))
      "Last modification time of the configuration file.")

    (defvar *show-async-tangle-results* nil
      "Keeps *emacs* async buffers around for later inspection.")

    (defun my/config-updated ()
      "Checks if the configuration file has been updated since the last time."
      (time-less-p *config-last-change*
                   (nth 5 (file-attributes *config-file*))))

    (defun my/config-tangle ()
      "Tangles the org file asynchronously."
      (when (my/config-updated)
        (setq *config-last-change*
              (nth 5 (file-attributes *config-file*)))
        (my/async-babel-tangle *config-file*)))

    (defun my/async-babel-tangle (org-file)
      "Tangles the org file asynchronously."
      (let ((init-tangle-start-time (current-time))
            (file (buffer-file-name))
            (async-quiet-switch "-q"))
        (async-start
         `(lambda ()
            (require 'org)
            (org-babel-tangle-file ,org-file))
         (unless *show-async-tangle-results*
           `(lambda (result)
              (if result
                  (message "SUCCESS: %s successfully tangled (%.2fs)."
                           ,org-file
                           (float-time (time-subtract (current-time)
                                                      ',init-tangle-start-time)))
                (message "ERROR: %s as tangle failed." ,org-file))))))))
#+END_SRC

** Killing text

From: https://github.com/itsjeyd/emacs-config/blob/emacs24/init.el

I find useful to delete a line and a region with only =C-w=

#+BEGIN_SRC emacs-lisp :tangle yes
  (defadvice kill-region (before slick-cut activate compile)
    "When called interactively with no active region, kill a single line instead."
    (interactive
     (if mark-active (list (region-beginning) (region-end))
       (list (line-beginning-position)
             (line-beginning-position 2)))))
#+END_SRC

** =Ibuffer=

Buffers can quickly become a mess. For some people, that's not a problem, but I
like to be able to easily find my way around.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package ibuffer
    :defer 2
    :bind ("C-x C-b" . ibuffer)
    :config
    (setq ibuffer-saved-filter-groups
          (quote (("default"
                   ("Dired" (mode . dired-mode))
                   ("Org" (name . "^.*org$"))
                   ("Web" (or (mode . web-mode) (mode . js2-mode)))
                   ("Shell" (or (mode . eshell-mode) (mode . shell-mode)))
                   ("Programming" (or
                                   (mode . python-mode)))
                   ("Emacs" (or
                             (name . "^\\*scratch\\*$")
                             (name . "^\\*Messages\\*$")))
                   ))))

    (add-hook 'ibuffer-mode-hook
              (lambda ()
                (ibuffer-auto-mode 1)
                (ibuffer-switch-to-saved-filter-groups "default"))))
#+END_SRC

