config.el

(use-package mu4e
  :ensure nil
  :custom
  (mu4e-attachment-dir "~/Downloads")
  (mu4e-compose-signature-auto-include nil)
  (mu4e-drafts-folder "/gmail/Drafts")
  (mu4e-get-mail-command "mbsync -a")
  (mu4e-maildir "~/Maildir")
  (mu4e-maildir-shortcuts
   '(("/gmail/INBOX" . ?i)
     ("/gmail/All Mail" . ?a)
     ("/gmail/Deleted Items" . ?d)
     ("/gmail/Drafts" . ?D)
     ("/gmail/Important" . ?i)
     ("/gmail/Sent Mail" . ?s)
     ("/gmail/Starred" . ?S)))
  (mu4e-refile-folder "/gmail/Archive")
  (mu4e-sent-folder "/gmail/Sent Mail")
  (mu4e-trash-folder "/gmail/Trash")
  (mu4e-update-interval 300)
  (mu4e-use-fancy-chars t)
  (mu4e-view-show-addresses t)
  (mu4e-view-show-images t))

(use-package mu4e-alert
  :after mu4e
  :hook ((after-init . mu4e-alert-enable-mode-line-display)
         (after-init . mu4e-alert-enable-notifications))
  :config
  (mu4e-alert-set-default-style 'libnotify))

(setq send-mail-function 'smtpmail-send-it
      smtpmail-smtp-server "smtp.gmail.com"
      smtpmail-smtp-service 465
      smtpmail-stream-type 'ssl)

(use-package webpaste
  :defer 3
  :bind (("C-c C-p C-b" . webpaste-paste-buffer)
         ("C-c C-p C-r" . webpaste-paste-region)))

(use-package pdf-tools
  :defer 1
  :init
  (pdf-tools-install)
  :custom
  (pdf-view-use-unicode-ligther nil))

(use-package expand-region
  :defer 2
  :bind (("C-+" . er/contract-region)
         ("C-=" . er/expand-region)))

(use-package projectile
  :defer 1
  :custom
  (projectile-cache-file (expand-file-name ".projectile-cache" user-emacs-directory)
  (projectile-completion-system 'ivy)
  (projectile-enable-caching t)
  (projectile-known-projects-file (expand-file-name
                                 ".projectile-bookmarks" user-emacs-directory))
  (projectile-mode-line '(:eval (projectile-project-name)))
  :config
  (define-key projectile-mode-map (kbd "C-c p") #'hydra-projectile/body)
  (projectile-global-mode)))

(use-package spotify
  :defer 5
  :config
  (spotify-enable-song-notifications))

(use-package git-commit
      :after magit
      :hook (git-commit-mode . me/git-commit-auto-fill-everywhere)
      :custom
      (git-commit-summary-max-length 50)
      :preface
      (defun me/git-commit-auto-fill-everywhere ()
	(setq fill-column 72)
	(setq-local comment-auto-fill-only-comments nil)))

(use-package magit
      :defer 2)

(use-package git-gutter
  :defer 2
  :diminish
  :init
  (global-git-gutter-mode +1))

(use-package git-timemachine
  :defer 3
  :diminish)

(use-package simple
  :ensure nil
  :hook ((prog-mode . turn-on-auto-fill)
         (text-mode . turn-on-auto-fill)))

(add-hook 'before-save-hook 'delete-trailing-whitespace)

(use-package async)
(use-package org
  :defer 1
  :hook (after-save . my/config-tangle)
  :config
  (defvar *config-file* "~/.emacs.d/config.org"
    "The configuration file.")

  (defvar *config-last-change* (nth 5 (file-attributes *config-file*))
    "Last modification time of the configuration file.")

  (defvar *show-async-tangle-results* nil
    "Keeps *emacs* async buffers around for later inspection.")

  (defun my/config-updated ()
    "Checks if the configuration file has been updated since the last time."
    (time-less-p *config-last-change*
                 (nth 5 (file-attributes *config-file*))))

  (defun my/config-tangle ()
    "Tangles the org file asynchronously."
    (when (my/config-updated)
      (setq *config-last-change*
            (nth 5 (file-attributes *config-file*)))
      (my/async-babel-tangle *config-file*)))

  (defun my/async-babel-tangle (org-file)
    "Tangles the org file asynchronously."
    (let ((init-tangle-start-time (current-time))
          (file (buffer-file-name))
          (async-quiet-switch "-q"))
      (async-start
       `(lambda ()
          (require 'org)
          (org-babel-tangle-file ,org-file))
       (unless *show-async-tangle-results*
         `(lambda (result)
            (if result
                (message "SUCCESS: %s successfully tangled (%.2fs)."
                         ,org-file
                         (float-time (time-subtract (current-time)
                                                    ',init-tangle-start-time)))
              (message "ERROR: %s as tangle failed." ,org-file))))))))

(defadvice kill-region (before slick-cut activate compile)
  "When called interactively with no active region, kill a single line instead."
  (interactive
   (if mark-active (list (region-beginning) (region-end))
     (list (line-beginning-position)
           (line-beginning-position 2)))))

(use-package ibuffer
  :defer 2
  :bind ("C-x C-b" . ibuffer)
  :config
  (setq ibuffer-saved-filter-groups
        (quote (("default"
                 ("Dired" (mode . dired-mode))
                 ("Org" (name . "^.*org$"))
                 ("Web" (or (mode . web-mode) (mode . js2-mode)))
                 ("Shell" (or (mode . eshell-mode) (mode . shell-mode)))
                 ("Programming" (or
                                 (mode . python-mode)))
                 ("Emacs" (or
                           (name . "^\\*scratch\\*$")
                           (name . "^\\*Messages\\*$")))
                 ))))

  (add-hook 'ibuffer-mode-hook
            (lambda ()
              (ibuffer-auto-mode 1)
              (ibuffer-switch-to-saved-filter-groups "default"))))
