config.org
** Replace the current file with the saved one

Avoids call the function or reload Emacs.

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-auto-revert-mode 1)
  (setq auto-revert-verbose nil)
  (global-set-key (kbd "C-x R") 'revert-buffer)
#+END_SRC

** Specific a command after saved file

I didn't see someone that implemented that before, that why I decided to created
my own function that automatic executes a specific bash command after saved a
specific file.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defvar *afilename-cmd*
    '(("/home/someone/.Xresources" . "xrdb -merge ~/.Xresources")
      ("/home/someone/.xbindkeysrc" . "xbindkeys -p"))
    "File association list with their respective command.")

  (defun my/cmd-after-saved-file ()
    "Execute a command after saved a specific file."
    (let* ((match (assoc (buffer-file-name) *afilename-cmd*)))
      (when match
        (shell-command (cdr match)))))

  (add-hook 'after-save-hook 'my/cmd-after-saved-file)
#+END_SRC

* Navigation

** Chromium as default browser

I prefer using Chromium the open-source version of Google Chrome that I find
more faster than Firefox.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq browse-url-browser-function 'browse-url-chromium)
#+END_SRC

** Copy filename to clipboard

From: http://emacsredux.com/blog/2013/03/27/copy-filename-to-the-clipboard/

Gives the possibility to copy the name of the currently visited file to the
clipboard.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun prelude-copy-file-name-to-clipboard ()
    "Copy the current buffer file name to the clipboard."
    (interactive)
    (let ((filename (if (equal major-mode 'dired-mode)
                        default-directory
                      (buffer-file-name))))
      (when filename
        (kill-new filename)
        (message "Copied buffer file name '%s' to the clipboard." filename))))
#+END_SRC

** =engine-mode=

I use it to do most of my querying search without leaving Emacs.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package engine-mode
    :defer 10
    :config
    (defengine amazon
      "http://www.amazon.com/s/ref=nb_sb_noss?url=search-alias%3Daps&field-keywords=%s"
      :keybinding "a")

    (defengine duckduckgo
      "https://duckduckgo.com/?q=%s"
      :keybinding "d")

    (defengine github
      "https://github.com/search?ref=simplesearch&q=%s"
      :keybinding "g")

    (defengine google-images
      "http://www.google.com/images?hl=en&source=hp&biw=1440&bih=795&gbv=2&aq=f&aqi=&aql=&oq=&q=%s"
      :keybinding "i")

    (defengine google-maps
      "http://maps.google.com/maps?q=%s"
      :keybinding "m"
      :docstring "Mappin' it up.")

    (defengine stack-overflow
      "https://stackoverflow.com/search?q=%s"
      :keybinding "s")

    (defengine wikipedia
      "http://www.wikipedia.org/search-redirect.php?language=en&go=Go&search=%s"
      :keybinding "w"
      :docstring "Searchin' the wikis.")

    (defengine youtube
      "http://www.youtube.com/results?aq=f&oq=&search_query=%s"
      :keybinding "y")
    (engine-mode t))
#+END_SRC

** =find-dired=

=find-dired= gives the possibility to display files from a directory.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package find-dired
    :defer 20
    :custom (find-ls-option '("-print0 | xargs -0 ls -ld" . "-ld")))
#+END_SRC

** Frequently-accessed files

Registers allow you to jump to a file or other location quickly. To jump to a
register, use =C-x r j= followed by the letter of the register. Using registers
for all these file shortcuts is probably a bit of a waste since I can easily
define my own keymap, but anyway, I rarely go beyond register. Also, I
might as well add shortcuts for refiling.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defvar my/refile-map (make-sparse-keymap))

  (defmacro my/defshortcut (key file)
    `(progn
       (set-register ,key (cons 'file ,file))
       (define-key my/refile-map
         (char-to-string ,key)
         (lambda (prefix)
           (interactive "p")
           (let ((org-refile-targets '(((,file) :maxlevel . 6)))
                 (current-prefix-arg (or current-prefix-arg '(4))))
             (call-interactively 'org-refile))))))

  (my/defshortcut ?I "~/.config/i3/config")
  (my/defshortcut ?S "~/.config/sway/config")
  (my/defshortcut ?X "~/.Xresources")
  (my/defshortcut ?b "~/Sync/shared/.personal/various/buy.org")
  (my/defshortcut ?c "~/.emacs.d/config.org")
  (my/defshortcut ?e "~/Sync/shared/elfeed/elfeed.org")
  (my/defshortcut ?i "~/.emacs.d/init.el")
  (my/defshortcut ?m "~/Sync/shared/.personal/various/movies.org")
  (my/defshortcut ?o "~/Sync/shared/.personal/organizer.org")
  (my/defshortcut ?p "~/Sync/shared/.personal/people.org")
  (my/defshortcut ?r "~/Sync/shared/.personal/routine.org")
  (my/defshortcut ?s "~/Sync/shared/.personal/school.org")
  (my/defshortcut ?t "~/Sync/shared/.personal/tfe.org")
#+END_SRC

** =move-text=

Moves the current line (or if marked, the current region’s, whole lines).

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package move-text
    :defer 2
    :bind (("M-p" . move-text-up)
           ("M-n" . move-text-down))
    :config (move-text-default-bindings))
#+END_SRC

** Move to beginning of line

From: http://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/

This function is a mix of =C-a= and =M-m=

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/smarter-move-beginning-of-line (arg)
    "Move point back to indentation of beginning of line.

  Move point to the first non-whitespace character on this line.
  If point is already there, move to the beginning of the line.
  Effectively toggle between the first non-whitespace character and
  the beginning of the line.

  If ARG is not nil or 1, move forward ARG - 1 lines first.  If
  point reaches the beginning or end of the buffer, stop there."
    (interactive "^p")
    (setq arg (or arg 1))

    ;; Move lines first
    (when (/= arg 1)
      (let ((line-move-visual nil))
        (forward-line (1- arg))))

    (let ((orig-point (point)))
      (back-to-indentation)
      (when (= orig-point (point))
        (move-beginning-of-line 1))))

  (global-set-key [remap move-beginning-of-line]
                  'my/smarter-move-beginning-of-line)
#+END_SRC

** Pop to mark

Jumps to mark, and pop a new position for mark off the ring.
Notice that it doesn't affect global mark ring.

#+BEGIN_SRC emacs-lisp :tangle yes
  (bind-key "C-x p" 'pop-to-mark-command)
  (setq set-mark-command-repeat-pop t)
#+END_SRC

** =recentf=

Provides fast access to the recent files.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package recentf
    :defer 2
    :bind ("C-c r" . recentf-open-files)
    :init (recentf-mode)
    :custom
    (recentf-max-saved-items 200)
    (recentf-max-menu-items 15)
    :config
    (run-at-time nil (* 5 60) 'recentf-save-list))
#+END_SRC

** =switch-window=

Displays an overlay in each window showing a unique key, then ask user for the
window where move to.

Most of people use =ace-window=, but I prefer =switch-window= because I find
this package more ergonomic by using the fact of displaying the number of the
buffer by hiding his contents.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package switch-window
    :bind (("C-x o" . switch-window)
           ("C-x w" . switch-window-then-swap-buffer)))
#+END_SRC

** =windmove=

Lets you move between windows with something more natural than cycling through
=C-x o= (=other-window=). Windmove doesn't behave well with Org, so we need to
use different keybindings.

Honestly, I most of times switch my windows with =switch-window=, but could be a
good complementary to it.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package windmove
    :defer 2
    :bind (("C-c h" . windmove-left)
           ("C-c j" . windmove-down)
           ("C-c k" . windmove-up)
           ("C-c l" . windmove-right)))
#+END_SRC

* Org-Mode

One of my favorite mode in Emacs. I mainly use it to organize my life, takes
notes and make my presentations, but you can do plenty of stuff with
it. =org-mode= it's like the sky, without limit.

** Basic configuration

Few lines for a basic confortable configuration.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-cycle-include-plain-lists 'integrate
        org-startup-folded nil
        org-startup-indented t
        org-yank-adjusted-subtrees t)

  (add-hook 'org-mode-hook #'visual-line-mode)
#+END_SRC

If like me, you're tired of manually updating your tables of contents, =toc-org
will maintain a table of contents at the first heading that has a =:TOC:= tag.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package toc-org
    :after org)
#+END_SRC

** Files

Here are the =.org= files stored in my =~/personal= folder that I use. I was
inspired by Sacha Chua for the structure that was already most of my needed.

| 101things.org | Goals for 101 things in 1001 days with my love                           |
| archive.org   | Archived subtrees                                                        |
| business.org  | Business-related notes and TODOs                                         |
| buy.org       | Things to buy                                                            |
| decisions.org | Pending, current, and reviewed decisions                                 |
| learning.org  | Learning plan                                                            |
| movies.org    | Movies watched and that I should watch                                   |
| organizer.org | My main Org file. Inbox for M-x org-capture, tasks, weekly reviews, etc. |
| people.org    | Tasks relatives to people                                                |
| projects.org  | Projects I work on                                                       |
| routine.org   | Daily tasks                                                              |
| school.org    | School tasks                                                             |
| trading.org   | trading notes                                                            |

