config.el

(global-auto-revert-mode 1)
(setq auto-revert-verbose nil)
(global-set-key (kbd "C-x R") 'revert-buffer)

(defvar *afilename-cmd*
  '(("/home/someone/.Xresources" . "xrdb -merge ~/.Xresources")
    ("/home/someone/.xbindkeysrc" . "xbindkeys -p"))
  "File association list with their respective command.")

(defun my/cmd-after-saved-file ()
  "Execute a command after saved a specific file."
  (let* ((match (assoc (buffer-file-name) *afilename-cmd*)))
    (when match
      (shell-command (cdr match)))))

(add-hook 'after-save-hook 'my/cmd-after-saved-file)

(setq browse-url-browser-function 'browse-url-chromium)

(defun prelude-copy-file-name-to-clipboard ()
  "Copy the current buffer file name to the clipboard."
  (interactive)
  (let ((filename (if (equal major-mode 'dired-mode)
                      default-directory
                    (buffer-file-name))))
    (when filename
      (kill-new filename)
      (message "Copied buffer file name '%s' to the clipboard." filename))))

(use-package engine-mode
  :defer 10
  :config
  (defengine amazon
    "http://www.amazon.com/s/ref=nb_sb_noss?url=search-alias%3Daps&field-keywords=%s"
    :keybinding "a")

  (defengine duckduckgo
    "https://duckduckgo.com/?q=%s"
    :keybinding "d")

  (defengine github
    "https://github.com/search?ref=simplesearch&q=%s"
    :keybinding "g")

  (defengine google-images
    "http://www.google.com/images?hl=en&source=hp&biw=1440&bih=795&gbv=2&aq=f&aqi=&aql=&oq=&q=%s"
    :keybinding "i")

  (defengine google-maps
    "http://maps.google.com/maps?q=%s"
    :keybinding "m"
    :docstring "Mappin' it up.")

  (defengine stack-overflow
    "https://stackoverflow.com/search?q=%s"
    :keybinding "s")

  (defengine wikipedia
    "http://www.wikipedia.org/search-redirect.php?language=en&go=Go&search=%s"
    :keybinding "w"
    :docstring "Searchin' the wikis.")

  (defengine youtube
    "http://www.youtube.com/results?aq=f&oq=&search_query=%s"
    :keybinding "y")
  (engine-mode t))

(use-package find-dired
  :defer 20
  :custom (find-ls-option '("-print0 | xargs -0 ls -ld" . "-ld")))

(defvar my/refile-map (make-sparse-keymap))

(defmacro my/defshortcut (key file)
  `(progn
     (set-register ,key (cons 'file ,file))
     (define-key my/refile-map
       (char-to-string ,key)
       (lambda (prefix)
         (interactive "p")
         (let ((org-refile-targets '(((,file) :maxlevel . 6)))
               (current-prefix-arg (or current-prefix-arg '(4))))
           (call-interactively 'org-refile))))))

(my/defshortcut ?I "~/.config/i3/config")
(my/defshortcut ?S "~/.config/sway/config")
(my/defshortcut ?X "~/.Xresources")
(my/defshortcut ?b "~/Sync/shared/.personal/various/buy.org")
(my/defshortcut ?c "~/.emacs.d/config.org")
(my/defshortcut ?e "~/Sync/shared/elfeed/elfeed.org")
(my/defshortcut ?i "~/.emacs.d/init.el")
(my/defshortcut ?m "~/Sync/shared/.personal/various/movies.org")
(my/defshortcut ?o "~/Sync/shared/.personal/organizer.org")
(my/defshortcut ?p "~/Sync/shared/.personal/people.org")
(my/defshortcut ?r "~/Sync/shared/.personal/routine.org")
(my/defshortcut ?s "~/Sync/shared/.personal/school.org")
(my/defshortcut ?t "~/Sync/shared/.personal/tfe.org")

(use-package move-text
  :defer 2
  :bind (("M-p" . move-text-up)
         ("M-n" . move-text-down))
  :config (move-text-default-bindings))

(defun my/smarter-move-beginning-of-line (arg)
  "Move point back to indentation of beginning of line.

Move point to the first non-whitespace character on this line.
If point is already there, move to the beginning of the line.
Effectively toggle between the first non-whitespace character and
the beginning of the line.

If ARG is not nil or 1, move forward ARG - 1 lines first.  If
point reaches the beginning or end of the buffer, stop there."
  (interactive "^p")
  (setq arg (or arg 1))

  ;; Move lines first
  (when (/= arg 1)
    (let ((line-move-visual nil))
      (forward-line (1- arg))))

  (let ((orig-point (point)))
    (back-to-indentation)
    (when (= orig-point (point))
      (move-beginning-of-line 1))))

(global-set-key [remap move-beginning-of-line]
                'my/smarter-move-beginning-of-line)

(bind-key "C-x p" 'pop-to-mark-command)
(setq set-mark-command-repeat-pop t)

(use-package recentf
  :defer 2
  :bind ("C-c r" . recentf-open-files)
  :init (recentf-mode)
  :custom
  (recentf-max-saved-items 200)
  (recentf-max-menu-items 15)
  :config
  (run-at-time nil (* 5 60) 'recentf-save-list))

(use-package switch-window
  :bind (("C-x o" . switch-window)
         ("C-x w" . switch-window-then-swap-buffer)))

(use-package windmove
  :defer 2
  :bind (("C-c h" . windmove-left)
         ("C-c j" . windmove-down)
         ("C-c k" . windmove-up)
         ("C-c l" . windmove-right)))

(setq org-cycle-include-plain-lists 'integrate
      org-startup-folded nil
      org-startup-indented t
      org-yank-adjusted-subtrees t)

(add-hook 'org-mode-hook #'visual-line-mode)

(use-package toc-org
  :after org)

(with-eval-after-load 'org
