config.org
** Keyboard shortcuts

Useful to speed up my daily life, I enjoy it!

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load 'org
    (bind-key "C-c a" 'org-agenda)
    (bind-key "C-c J" 'org-clock-goto)
    (bind-key "C-c K" 'org-cut-subtree org-mode-map)
    (bind-key "C-c c" 'org-capture)
    (bind-key "C-c s" 'org-store-link)
    (bind-key "C-c v" 'org-show-todo-tree org-mode-map)
    (bind-key "C-c C-w" 'org-refile)
    (bind-key "C-c L" 'org-insert-link-global)
    (bind-key "C-c O" 'org-open-at-point-global)
    (bind-key "C-c R" 'org-reveal org-mode-map)
    (bind-key "C-TAB" 'org-cycle org-mode-map)
    (bind-key "C-M-w" 'append-next-kill org-mode-map))
#+END_SRC

** Languages

With that, I can compile many languages.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org
    :hook (org-mode . toc-org-enable)
    :init
    (require 'ob-C)
    (require 'ob-css)
    (require 'ob-ditaa)
    (require 'ob-dot)
    (require 'ob-emacs-lisp)
    (require 'ob-gnuplot)
    (require 'ob-java)
    (require 'ob-js)
    (require 'ob-latex)
    (require 'ob-makefile)
    (require 'ob-org)
    (require 'ob-plantuml)
    (require 'ob-python)
    (require 'ob-ruby)
    (require 'ob-shell)
    (require 'ob-sql)
    :custom
    (org-plantuml-jar-path (expand-file-name "~/Sync/shared/lib/plantuml.jar"))
    (org-ditaa-jar-path "~/Sync/shared/lib/ditaa0_9.jar"))
#+END_SRC

** Modules

Org has a whole bunch of optional modules. These are the ones I'm
currently experimenting with.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-modules '(org-info
                      org-crypt
                      org-habit
                      org-irc
                      org-mouse
                      org-protocol))
  '(org-load-modules-maybe t)
  (setq org-export-backends '(ascii beamer html icalendar latex man md org texinfo))
#+END_SRC

** Speed commands

Useful to generate the header of my =org= files.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun header-org-mode ()
    (interactive)
    (insert "#+TITLE: " (file-name-nondirectory (file-name-sans-extension (buffer-file-name))) "\n")
    (insert "#+AUTHOR: " (user-full-name) "\n")
    (insert "#+EMAIL: " "terencio.agozzino@gmail.com" "\n")
    (insert "#+OPTIONS: H:2 num:t toc:nil\n")
    (insert "#+OPTIONS: ^:nil\n")
    (insert "#+OPTIONS: <:nil todo:nil *:t ^:{} @:t ::t |:t TeX:t\n"))
#+END_SRC

These are great for quickly acting on tasks.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-use-effective-time t)

  (defun my/org-use-speed-commands-for-headings-and-lists ()
    "Activate speed commands on list items too."
    (or (and (looking-at org-outline-regexp) (looking-back "^\**"))
        (save-excursion (and (looking-at (org-item-re)) (looking-back "^[ \t]*")))))
  (setq org-use-speed-commands 'my/org-use-speed-commands-for-headings-and-lists)

  (with-eval-after-load 'org
    (add-to-list 'org-speed-commands-user '("x" org-todo "DONE"))
    (add-to-list 'org-speed-commands-user '("y" org-todo-yesterday "DONE"))
    (add-to-list 'org-speed-commands-user '("!" my/org-clock-in-and-track))
    (add-to-list 'org-speed-commands-user '("s" call-interactively 'org-schedule))
    (add-to-list 'org-speed-commands-user '("d" my/org-move-line-to-destination))
    (add-to-list 'org-speed-commands-user '("i" call-interactively 'org-clock-in))
    (add-to-list 'org-speed-commands-user '("o" call-interactively 'org-clock-out))
    (add-to-list 'org-speed-commands-user '("$" call-interactively 'org-archive-subtree)))
#+END_SRC

From: http://stackoverflow.com/questions/15011703/is-there-an-emacs-org-mode-command-to-jump-to-an-org-heading

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-goto-interface 'outline
        org-goto-max-level 10)
#+END_SRC

I often cut and paste subtrees. This makes it easier to cut something and paste
it elsewhere in the hierarchy.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-startup-folded nil)
  (setq org-cycle-include-plain-lists 'integrate)
  (setq org-yank-adjusted-subtrees t)
#+END_SRC

** Move line

#+BEGIN_SRC emacs-lisp :tangle yes
    (defun my/org-move-line-to-destination ()
      "Moves the current list item to <<destination>> in the current buffer.
    If no <<destination>> is found, move it to the end of the list
    and indent it one level."
      (interactive)
      (save-window-excursion
        (save-excursion
          (let ((string
                 (buffer-substring-no-properties
                  (line-beginning-position) (line-end-position)))
                found)
            (delete-region (line-beginning-position) (1+ (line-end-position)))
            (save-excursion
              (goto-char (point-min))
              (when (re-search-forward "<<destination>>" nil t)
                (insert "\n" (make-string (- (match-beginning 0) (line-beginning-position)) ?\ ) (s-trim string))
                (setq found t)))
            (unless found
              (org-end-of-item-list)
              (insert string "\n"))))))
#+END_SRC

* Org Agenda

** Basic configuration

I am a fan about the organization made by Sacha Chua, which is why most of
the functions added above come essentially from her.

My org files are in my =personal= directory from my [[https://www.dropbox.com/][Sync]]. That way, I can
update my =.org= files from multiple computers and smartphones.

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'org-agenda)
  (setq org-directory "~/Sync/shared/personal")
  (setq org-default-notes-file "~/Sync/shared/.personal/organizer.org")
#+END_SRC

Here is the place where I put all my =.org= files that will be read by =org-agenda=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-agenda-files
        (delq nil
              (mapcar (lambda (x) (and (file-exists-p x) x))
                      '("~/Sync/shared/.personal/101things.org"
                        "~/Sync/shared/.personal/business.org"
                        "~/Sync/shared/.personal/decisions.org"
                        "~/Sync/shared/.personal/learning.org"
                        "~/Sync/shared/.personal/internship.org"
                        "~/Sync/shared/.personal/organizer.org"
                        "~/Sync/shared/.personal/people.org"
                        "~/Sync/shared/.personal/projects.org"
                        "~/Sync/shared/.personal/routine.org"
                        "~/Sync/shared/.personal/school.org"
                        "~/Sync/shared/.personal/tfe.org"))))
  (add-to-list 'auto-mode-alist '("\\.txt$" . org-mode))
#+END_SRC

This quickly adds a same-level heading for the succeeding day.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/org-insert-heading-for-next-day ()
    "Insert a same-level heading for the following day."
    (interactive)
    (let ((new-date
           (seconds-to-time
            (+ 86400.0
               (float-time
                (org-read-date nil 'to-time (elt (org-heading-components) 4)))))))
      (org-insert-heading-after-current)
      (insert (format-time-string "%Y-%m-%d\n\n" new-date))))
#+END_SRC

I like looking at two days at a time when I plan using the Org agenda. I want to
see my log entries, but I don't want to see scheduled items that I've
finished. I like seeing a time grid so that I can get a sense of how
appointments are spread out.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-agenda-span 2)
  (setq org-agenda-tags-column -100) ; take advantage of the screen width
  (setq org-agenda-sticky nil)
  (setq org-agenda-inhibit-startup t)
  (setq org-agenda-use-tag-inheritance t)
  (setq org-agenda-show-log t)
  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-skip-deadline-if-done t)
  (setq org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled)
  (setq org-agenda-time-grid
        '((daily today require-timed)))
  (setq org-columns-default-format "%14SCHEDULED %Effort{:} %1PRIORITY %TODO %50ITEM %TAGS")
  ;; (setq org-agenda-time-grid
  ;;       '((daily today require-timed)
  ;;         "----------------"
  ;;         (800 1000 1200 1400 1600 1800)))
#+end_SRC

*** Task dependencies

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-enforce-todo-dependencies t)
  (setq org-track-ordered-property-with-tag t)
  (setq org-agenda-dim-blocked-tasks t)
#+END_SRC

*** Starting my weeks on Saturday

I want the Org agenda to start on Saturday, because I like looking at weekends
as week beginnings instead.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-agenda-start-on-weekday 6)
#+END_SRC

** Archiving

I will automate the archiving of my done tasks in the future.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/org-archive-done-tasks ()
    "Archive finished or cancelled tasks."
    (interactive)
    (org-map-entries
     (lambda ()
       (org-archive-subtree)
       (setq org-map-continue-from (outline-previous-heading)))
     "TODO=\"DONE\"|TODO=\"CANCELLED\"" (if (org-before-first-heading-p) 'file 'tree)))
#+END_SRC

