config.org
** Capture

I use =org-capture= templates to quickly jot down tasks, ledger entries, notes,
and other semi-structured pieces of information.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/org-contacts-template-email (&optional return-value)
    "Try to return the contact email for a template.
          If not found return RETURN-VALUE or something that would ask the user."
    (or (cadr (if (gnus-alive-p)
                  (gnus-with-article-headers
                   (mail-extract-address-components
                    (or (mail-fetch-field "Reply-To") (mail-fetch-field "From") "")))))
        return-value
        (concat "%^{" org-contacts-email-property "}p")))

  (defvar my/org-basic-task-template "* TODO %^{Task}
    :PROPERTIES:
    :Effort: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
    :END:
    Captured %<%Y-%m-%d %H:%M>
    %?

    %i
    " "Basic task data")

  (defvar my/org-basic-trade-template "* Trade
    Previous Balance: %^{PreviousBalance}
    Next Balance: %^{NextBalance}
    Captured %<%Y-%m-%d>
    %?

    %i
    " "Basic trade data")

  (setq org-capture-templates
        `(("b" "Buy task" checkitem (file+headline "~/Sync/shared/.personal/various/buy.org" "To Buy")
           "- [ ] %^{Task}"
           :immediate-finish t)
          ("i" "Interrupting task" entry (file+headline "~/Sync/shared/.personal/organizer.org" "Inbox")
           "* STARTED %^{Task}"
           :clock-in :clock-resume)
          ("m" "Movie task" checkitem (file+headline "~/Sync/shared/.personal/various/movies.org" "To Watch")
           "- [ ] %^{Task}"
           :immediate-finish t)
          ("p" "People task" entry (file+headline "~/Sync/shared/.personal/people.org" "Tasks"),
           my/org-basic-task-template
           :immediate-finish t)
          ("s" "School task" entry (file+headline "~/Sync/shared/.personal/school.org" "Tasks"),
           my/org-basic-task-template
           :immediate-finish t)
          ("t" "Trading" entry (file+headline "~/Sync/shared/.personal/trading.org" "Trades/Day"),
           my/org-basic-trade-template
           :immediate-finish t)
          ("T" "Tasks" entry (file+headline "~/Sync/shared/.personal/organizer.org" "Tasks"),
           my/org-basic-task-template
           :immediate-finish t)
          ("F" "TFE Tasks" entry (file+headline "~/Sync/shared/.personal/tfe.org" "Tasks"),
           my/org-basic-task-template
           :immediate-finish t)))
#+END_SRC

This allow to capture a task based on the agenda.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/org-agenda-new ()
    "Create a new note or task at the current agenda item.
  Creates it at the same level as the previous task, so it's better to use
  this with to-do items than with projects or headings."
    (interactive)
    (org-agenda-switch-to)
    (org-capture 0))

;;  (define-key org-agenda-mode-map "N" 'my/org-agenda-new)
#+END_SRC

** Custom commands

There are quite a few custom commands here, and I often forget to use them. =)
But it's good to define them, and over time, I'll get the hang of using these
more!

| Key         | Description                                                                                    |
| .           | What am I waiting for?                                                                         |
| T           | Not really an agenda command - shows the to-do tree in the current file                        |
| b           | Shows business-related tasks                                                                   |
| o           | Shows personal tasks and miscellaneous tasks (o: organizer)                                    |
| w           | Show all tasks for the upcoming week                                                           |
| W           | Show all tasks for the upcoming week, aside from the routine ones                              |
| g ...       | Show tasks by context: b - business; c - coding; w - writing; p - phone; d - drawing, h - home |
| 0           | Show common contexts with up to 3 tasks each, so that I can choose what I feel like working on |
| ) (shift-0) | Show common contexts with all the tasks associated with them                                   |
| 9           | Show common contexts with up to 3 unscheduled tasks each                                       |
| ( (shift-9) | Show common contexts with all the unscheduled tasks associated with them                       |
| d           | Timeline for today (agenda, clock summary)                                                     |
| u           | Unscheduled tasks to do if I have free time                                                    |
| U           | Unscheduled tasks that are not part of projects                                                |
| P           | Tasks by priority                                                                              |
| p           | My projects                                                                                    |
| 2           | Projects with tasks                                                                            |

#+BEGIN_SRC emacs-lisp :tangle yes
  (defvar my/org-agenda-contexts
    '((tags-todo "+@phone")
      (tags-todo "+@work")
      (tags-todo "+@love")
      (tags-todo "+@coding")
      (tags-todo "+@writing")
      (tags-todo "+@computer")
      (tags-todo "+@home")
      (tags-todo "+@school")
      (tags-todo "+@errands"))
    "Usual list of contexts.")
  (bind-key "<apps> a" 'org-agenda)
#+END_SRC

** Habits

I like using [[http://orgmode.org/manual/Tracking-your-habits.html][org-habit]] to track my routine life. My task names tend to be a bit
long, though, so I've configured the graph column to show a little bit more to
the right.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-habit-graph-column 80)
  (setq org-habit-show-habits-only-for-today nil)
#+END_SRC

If you want to use habits, be sure to schedule your tasks and add a =STYLE=
property with the value of =habit= to the tasks you want displayed.

** Projects

Headings with the =:project:= tag, so we generally don't want that tag
inherited, except when we display unscheduled tasks that don't belong to any
projects.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-tags-exclude-from-inheritance '("project"))
#+END_SRC

This code makes it easy for me to focus on one project and its tasks.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-to-list 'org-speed-commands-user '("N" org-narrow-to-subtree))
  (add-to-list 'org-speed-commands-user '("W" widen))

  (defmacro my/org-with-current-task (&rest body)
    "Execute BODY with the point at the subtree of the current task."
    `(if (derived-mode-p 'org-agenda-mode)
         (save-window-excursion
           (org-agenda-switch-to)
           ,@body)
       ,@body))

  (defun my/org-agenda-for-subtree ()
    (interactive)
    (when (derived-mode-p 'org-agenda-mode) (org-agenda-switch-to))
    (my/org-with-current-task
     (let ((org-agenda-view-columns-initially t))
       (org-agenda nil "t" 'subtree))))
  (add-to-list 'org-speed-commands-user '("T" my/org-agenda-for-subtree))
#+END_SRC

There's a proper way to do this, with =<=. Oh, that would work
nicely. =< C-c a t= too.

*** Viewing
**** Projects

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/org-show-active-projects ()
    "Show my current projects."
    (interactive)
    (org-tags-view nil "project-inactive-someday"))
#+END_SRC

