config.el

(defun my/org-contacts-template-email (&optional return-value)
  "Try to return the contact email for a template.
        If not found return RETURN-VALUE or something that would ask the user."
  (or (cadr (if (gnus-alive-p)
                (gnus-with-article-headers
                 (mail-extract-address-components
                  (or (mail-fetch-field "Reply-To") (mail-fetch-field "From") "")))))
      return-value
      (concat "%^{" org-contacts-email-property "}p")))

(defvar my/org-basic-task-template "* TODO %^{Task}
  :PROPERTIES:
  :Effort: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
  :END:
  Captured %<%Y-%m-%d %H:%M>
  %?

  %i
  " "Basic task data")

(defvar my/org-basic-trade-template "* Trade
  Previous Balance: %^{PreviousBalance}
  Next Balance: %^{NextBalance}
  Captured %<%Y-%m-%d>
  %?

  %i
  " "Basic trade data")

(setq org-capture-templates
      `(("b" "Buy task" checkitem (file+headline "~/Sync/shared/.personal/various/buy.org" "To Buy")
         "- [ ] %^{Task}"
         :immediate-finish t)
        ("i" "Interrupting task" entry (file+headline "~/Sync/shared/.personal/organizer.org" "Inbox")
         "* STARTED %^{Task}"
         :clock-in :clock-resume)
        ("m" "Movie task" checkitem (file+headline "~/Sync/shared/.personal/various/movies.org" "To Watch")
         "- [ ] %^{Task}"
         :immediate-finish t)
        ("p" "People task" entry (file+headline "~/Sync/shared/.personal/people.org" "Tasks"),
         my/org-basic-task-template
         :immediate-finish t)
        ("s" "School task" entry (file+headline "~/Sync/shared/.personal/school.org" "Tasks"),
         my/org-basic-task-template
         :immediate-finish t)
        ("t" "Trading" entry (file+headline "~/Sync/shared/.personal/trading.org" "Trades/Day"),
         my/org-basic-trade-template
         :immediate-finish t)
        ("T" "Tasks" entry (file+headline "~/Sync/shared/.personal/organizer.org" "Tasks"),
         my/org-basic-task-template
         :immediate-finish t)
        ("F" "TFE Tasks" entry (file+headline "~/Sync/shared/.personal/tfe.org" "Tasks"),
         my/org-basic-task-template
         :immediate-finish t)))

(defun my/org-agenda-new ()
    "Create a new note or task at the current agenda item.
  Creates it at the same level as the previous task, so it's better to use
  this with to-do items than with projects or headings."
    (interactive)
    (org-agenda-switch-to)
    (org-capture 0))

;;  (define-key org-agenda-mode-map "N" 'my/org-agenda-new)

(defvar my/org-agenda-contexts
  '((tags-todo "+@phone")
    (tags-todo "+@work")
    (tags-todo "+@love")
    (tags-todo "+@coding")
    (tags-todo "+@writing")
    (tags-todo "+@computer")
    (tags-todo "+@home")
    (tags-todo "+@school")
    (tags-todo "+@errands"))
  "Usual list of contexts.")
(bind-key "<apps> a" 'org-agenda)

(setq org-habit-graph-column 80)
(setq org-habit-show-habits-only-for-today nil)

(setq org-tags-exclude-from-inheritance '("project"))

(add-to-list 'org-speed-commands-user '("N" org-narrow-to-subtree))
(add-to-list 'org-speed-commands-user '("W" widen))

(defmacro my/org-with-current-task (&rest body)
  "Execute BODY with the point at the subtree of the current task."
  `(if (derived-mode-p 'org-agenda-mode)
       (save-window-excursion
         (org-agenda-switch-to)
         ,@body)
     ,@body))

(defun my/org-agenda-for-subtree ()
  (interactive)
  (when (derived-mode-p 'org-agenda-mode) (org-agenda-switch-to))
  (my/org-with-current-task
   (let ((org-agenda-view-columns-initially t))
     (org-agenda nil "t" 'subtree))))
(add-to-list 'org-speed-commands-user '("T" my/org-agenda-for-subtree))

(defun my/org-show-active-projects ()
  "Show my current projects."
  (interactive)
  (org-tags-view nil "project-inactive-someday"))
