config.org
* Journal

Recently, I started writing a journal about my daily life as I read that
journals improve mental claritym, help solve problems, improve overall focus,
insight and understanding, track the overall development and facilitate personal
growth.

Think so that it can be only benefit for myself.

Most of useful functions below are from:
https://github.com/howardabrams/dot-files/blob/master/emacs-org.org

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-journal
    :bind (("C-c t" . org-journal-new-entry)
           ("C-c y" . journal-file-yesterday))
    :custom
    (org-journal-dir "~/Sync/shared/.journal/2018/")
    (org-journal-file-format "%Y%m%d")
    (org-journal-date-format "%e %b %Y (%A)")
    (org-journal-time-format "")
    (org-journal-enable-encryption t)
    :preface
    (defun get-journal-file-yesterday ()
      "Gets filename for yesterday's journal entry."
      (let* ((yesterday (time-subtract (current-time) (days-to-time 1)))
             (daily-name (format-time-string "%Y%m%d" yesterday)))
        (expand-file-name (concat org-journal-dir daily-name))))

    (defun journal-file-yesterday ()
      "Creates and load a file based on yesterday's date."
      (interactive)
      (find-file (get-journal-file-yesterday)))

    (defun journal-last-year-file ()
      "Gets the string corresponding to the journal entry that
  happened 'last year' at this same time (meaning on the same day
  of the week)."
      (let* ((last-year-seconds (- (float-time) (* 365 24 60 60)))
             (last-year (seconds-to-time last-year-seconds))
             (last-year-dow (nth 6 (decode-time last-year)))
             (this-year-dow (nth 6 (decode-time)))
             (difference (if (> this-year-dow last-year-dow)
                             (- this-year-dow last-year-dow)
                           (- last-year-dow this-year-dow)))
             (target-date-seconds (+ last-year-seconds (* difference 24 60 60)))
             (target-date (seconds-to-time target-date-seconds)))
        (format-time-string "%Y%m%d" target-date)))

    (defun journal-last-year ()
      "Loads last year's journal entry, which is not necessary the
  same day of the month, but will be the same day of the week."
      (interactive)
      (let ((journal-file (concat org-journal-dir (journal-last-file))))
        (find-file journal-file))))
#+END_SRC

like any good journals, we don't want other people to be able to read it.

** Encryption/Decryption

To be able to enable encryption and decryption of =.gpg= files with =org-mode=,
we will need to install =gnupg2=.

Once this is done, we simply configure =epa=, the EasyPG Emacs assistant and
=org-crypt= to accept our public key identifier to allow asymmetric encryption.

*NOTE:* you need to modify the =org-crypt-key= variable to replace my key
identifier, by yours (or =nil= to allow symmetric encryption).

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package epa
    :defer 2
    :custom
    (epg-gpg-program "gpg"))

  (use-package org
    :bind ("C-c d" . org-decrypt-entry)
    ;; :init (org-crypt-use-before-save-magic)
    :custom
    (org-tags-exclude-from-inheritance (quote ("crypt")))
    (org-crypt-key "E9AADC36E94A672D1A07D49B208FCDBB98190562")
    (auto-save-default nil))
#+END_SRC

** Reveal.js

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package ox-reveal
    :defer 2
    :config
    (setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
    (setq org-reveal-mathjax t))

  (use-package htmlize :defer 2)
#+END_SRC

* Plugins configuration

** =aggressive-indent=

Auto-indent code as you write.

#+BEGIN_QUOTE
=electric-indent-mode= is enough to keep your code nicely aligned when all you
do is type. However, once you start shifting blocks around, transposing lines,
or slurping and barfing sexps, indentation is bound to go wrong.

=aggressive-indent-mode= is a minor mode that keeps your code *always* indented.
It reindents after every change, making it more reliable than
electric-indent-mode.

[[https://github.com/Malabarba/aggressive-indent-mode][Artur Malabarba]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package aggressive-indent
    :defer 2
    :hook (python-mode . aggressive-indent-mode)
    :custom
    (aggressive-indent-comments-too))
#+END_SRC

** =atomic chrome=

Helpful when I need to edit text areas of the browser in Emacs.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package atomic-chrome
    :defer 2
    :hook (atomic-chrome-edit-mode . flyspell-mode)
    :init
    (defun atomic-chrome-server-running-p ()
      (cond ((executable-find "lsof")
             (zerop (call-process "lsof" nil nil nil "-i" ":64292")))
            ((executable-find "netstat") ; Windows
             (zerop (call-process-shell-command "netstat -aon | grep 64292")))))

    (if (atomic-chrome-server-running-p)
        (message "Can't start atomic-chrome server, because port 64292 is already used")
      (atomic-chrome-start-server)))
#+END_SRC

** =calc=

May be useful in a timely manner.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package calc
    :defer t
    :custom
    (math-additional-units
     '((GiB "1024 * MiB" "Giga Byte")
       (MiB "1024 * KiB" "Mega Byte")
       (KiB "1024 * B" "Kilo Byte")
       (B nil "Byte")
       (Gib "1024 * Mib" "Giga Bit")
       (Mib "1024 * Kib" "Mega Bit")
       (Kib "1024 * b" "Kilo Bit")
       (b "B / 8" "Bit")))
    (math-units-table nil))
#+END_SRC

** =which-key=

It's difficult to remember all the keyboard shortcuts. The =which-key= package
helps to solve this.

I used =guide-key= in my past days, but =which-key= is a good replacement.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package which-key
    :diminish
    :commands which-key-mode
    :config
    (which-key-mode))
#+END_SRC
** =flycheck=

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package flycheck
    :defer 2
    :hook ((emacs-lisp-mode python-mode) . flycheck-mode)
    :config
    (setq-default
     flycheck-check-syntax-automatically '(save mode-enabled)
     flycheck-disabled-checkers '(emacs-lisp-checkdoc)
     flycheck-display-errors-delay .3)
    (flycheck-define-checker my-php
      "A PHP syntax checker using the PHP command line interpreter.
        See URL `http://php.net/manual/en/features.commandline.php'."
      :command ("php" "-l" "-d" "error_reporting=E_ALL" "-d" "display_errors=1"
                "-d" "log_errors=0" source)
      :error-patterns
      ((error line-start (or "Parse" "Fatal" "syntax") " error" (any ":" ",") " "
              (message) " in " (file-name) " on line " line line-end))
      :modes (php-mode php+-mode web-mode)))
#+END_SRC

** =hungry-delete=

Deleting a whitespace character will delete all whitespace until the next
non-whitespace character.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package hungry-delete
    :defer 2
    :diminish
    :config
    (global-hungry-delete-mode))
#+END_SRC

** =iedit=

Edit multiple regions in the same way simultaneously

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package iedit :defer t)
#+END_SRC

** =ipcalc=

Allows me to avoid calculating network ranges.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package ipcalc
    :commands ipcalc)
#+END_SRC
** =ledger=

I usually use ledger to take a track of my finance.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package ledger-mode
    :mode "\\.ledger\\'"
    :custom
    (ledger-clear-whole-transactions 1)
    ;; https://xkcd.com/1179/
    (ledger-use-iso-dates t))

    (use-package flycheck-ledger
      :after ledger-mode)
#+END_SRC

If you plan to use it, don’t forget installing it via your favorte AUR helpers
if you using =Arch Linux= like I do. Otherwise, see for your case.

#+BEGIN_SRC bash :tangle yes
  trizen -S ledger
#+END_SRC

** =rainbow-mode=

Minor mode for Emacs which displays strings representing
colors with the color they represent as background.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package rainbow-mode
    :commands rainbow-mode)
#+END_SRC

** =skewer-mode=

Provides live interaction with JavaScript, CSS, and HTML in a web
browser. Expressions are sent on-the-fly from an editing buffer to be evaluated
in the browser, like Emacs does with an inferior Lisp process in Lisp
modes.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package skewer-mode
    :defer 3
    :hook ((js2-mode . skewer-mode)
           (css-mode . skewer-css-mode)
           (html-mode . skewer-html-mode)
           (web-mode . skewer-html-mode)))
#+END_SRC
** =swiper=

Provides to myself isearch with an overview.

I also use =counsel= to easily find my files.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package swiper
    :after ivy
    :bind (("C-s" . swiper)
           ("C-r" . swiper)
           ("C-c C-r" . ivy-resume)
           ("M-x" . counsel-M-x)
           ("C-x C-f" . counsel-find-file)))

  (use-package counsel
    :after ivy
    :bind ("M-y" . counsel-yank-pop))
#+END_SRC

** =impatient-mode=

Useful to see the effect of then HTML when you type it.

To use =impatient mode= , you need to enable the web server provided by
=simple-httpd=. For that, use =M-x httpd-start=, open your browser to
=http://localhost:8080/imp/= and select your buffer to watch your changes appear
as you type!

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package simple-httpd
    :defer 4
    :custom
    (httpd-root "/var/www/html"))

  (use-package impatient-mode
    :after simple-httpd
    :hook ((web-mode . httpd-start)
           (web-mode . impatient-mode)
           (css-mode . httpd-start)))
#+END_SRC

** =smartparens=

According to myself, this is most powerful package to deal with parenthesis.
Anyway, if you don't like it you can try take a look to =paredit= or =autopair=

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package smartparens :defer 2)
#+END_SRC
** =try=

Useful to temporary use a package.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package try :defer 5)
#+END_SRC

** =undo-tree=

Emacs's undo system allows you to recover any past state of a buffer. To do
this, Emacs treats "undo itself as another editing that can be undone.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package undo-tree
    :diminish
    :bind ("C--" . undo-tree-redo)
    :init (global-undo-tree-mode)
    :custom
    (undo-tree-visualizer-timestamps t)
    (undo-tree-visualizer-diff t))
#+END_SRC

