config.el

(use-package org-journal
  :bind (("C-c t" . org-journal-new-entry)
         ("C-c y" . journal-file-yesterday))
  :custom
  (org-journal-dir "~/Sync/shared/.journal/2018/")
  (org-journal-file-format "%Y%m%d")
  (org-journal-date-format "%e %b %Y (%A)")
  (org-journal-time-format "")
  (org-journal-enable-encryption t)
  :preface
  (defun get-journal-file-yesterday ()
    "Gets filename for yesterday's journal entry."
    (let* ((yesterday (time-subtract (current-time) (days-to-time 1)))
           (daily-name (format-time-string "%Y%m%d" yesterday)))
      (expand-file-name (concat org-journal-dir daily-name))))

  (defun journal-file-yesterday ()
    "Creates and load a file based on yesterday's date."
    (interactive)
    (find-file (get-journal-file-yesterday)))

  (defun journal-last-year-file ()
    "Gets the string corresponding to the journal entry that
happened 'last year' at this same time (meaning on the same day
of the week)."
    (let* ((last-year-seconds (- (float-time) (* 365 24 60 60)))
           (last-year (seconds-to-time last-year-seconds))
           (last-year-dow (nth 6 (decode-time last-year)))
           (this-year-dow (nth 6 (decode-time)))
           (difference (if (> this-year-dow last-year-dow)
                           (- this-year-dow last-year-dow)
                         (- last-year-dow this-year-dow)))
           (target-date-seconds (+ last-year-seconds (* difference 24 60 60)))
           (target-date (seconds-to-time target-date-seconds)))
      (format-time-string "%Y%m%d" target-date)))

  (defun journal-last-year ()
    "Loads last year's journal entry, which is not necessary the
same day of the month, but will be the same day of the week."
    (interactive)
    (let ((journal-file (concat org-journal-dir (journal-last-file))))
      (find-file journal-file))))

(use-package epa
  :defer 2
  :custom
  (epg-gpg-program "gpg"))

(use-package org
  :bind ("C-c d" . org-decrypt-entry)
  ;; :init (org-crypt-use-before-save-magic)
  :custom
  (org-tags-exclude-from-inheritance (quote ("crypt")))
  (org-crypt-key "E9AADC36E94A672D1A07D49B208FCDBB98190562")
  (auto-save-default nil))

(use-package ox-reveal
  :defer 2
  :config
  (setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
  (setq org-reveal-mathjax t))

(use-package htmlize :defer 2)

(use-package aggressive-indent
  :defer 2
  :hook (python-mode . aggressive-indent-mode)
  :custom
  (aggressive-indent-comments-too))

(use-package atomic-chrome
  :defer 2
  :hook (atomic-chrome-edit-mode . flyspell-mode)
  :init
  (defun atomic-chrome-server-running-p ()
    (cond ((executable-find "lsof")
           (zerop (call-process "lsof" nil nil nil "-i" ":64292")))
          ((executable-find "netstat") ; Windows
           (zerop (call-process-shell-command "netstat -aon | grep 64292")))))

  (if (atomic-chrome-server-running-p)
      (message "Can't start atomic-chrome server, because port 64292 is already used")
    (atomic-chrome-start-server)))

(use-package calc
  :defer t
  :custom
  (math-additional-units
   '((GiB "1024 * MiB" "Giga Byte")
     (MiB "1024 * KiB" "Mega Byte")
     (KiB "1024 * B" "Kilo Byte")
     (B nil "Byte")
     (Gib "1024 * Mib" "Giga Bit")
     (Mib "1024 * Kib" "Mega Bit")
     (Kib "1024 * b" "Kilo Bit")
     (b "B / 8" "Bit")))
  (math-units-table nil))

(use-package which-key
  :diminish
  :commands which-key-mode
  :config
  (which-key-mode))

(use-package flycheck
  :defer 2
  :hook ((emacs-lisp-mode python-mode) . flycheck-mode)
  :config
  (setq-default
   flycheck-check-syntax-automatically '(save mode-enabled)
   flycheck-disabled-checkers '(emacs-lisp-checkdoc)
   flycheck-display-errors-delay .3)
  (flycheck-define-checker my-php
    "A PHP syntax checker using the PHP command line interpreter.
      See URL `http://php.net/manual/en/features.commandline.php'."
    :command ("php" "-l" "-d" "error_reporting=E_ALL" "-d" "display_errors=1"
              "-d" "log_errors=0" source)
    :error-patterns
    ((error line-start (or "Parse" "Fatal" "syntax") " error" (any ":" ",") " "
            (message) " in " (file-name) " on line " line line-end))
    :modes (php-mode php+-mode web-mode)))

(use-package hungry-delete
  :defer 2
  :diminish
  :config
  (global-hungry-delete-mode))

(use-package iedit :defer t)

(use-package ipcalc
  :commands ipcalc)

(use-package ledger-mode
  :mode "\\.ledger\\'"
  :custom
  (ledger-clear-whole-transactions 1)
  ;; https://xkcd.com/1179/
  (ledger-use-iso-dates t))

  (use-package flycheck-ledger
    :after ledger-mode)

(use-package rainbow-mode
  :commands rainbow-mode)

(use-package skewer-mode
  :defer 3
  :hook ((js2-mode . skewer-mode)
         (css-mode . skewer-css-mode)
         (html-mode . skewer-html-mode)
         (web-mode . skewer-html-mode)))

(use-package swiper
  :after ivy
  :bind (("C-s" . swiper)
         ("C-r" . swiper)
         ("C-c C-r" . ivy-resume)
         ("M-x" . counsel-M-x)
         ("C-x C-f" . counsel-find-file)))

(use-package counsel
  :after ivy
  :bind ("M-y" . counsel-yank-pop))

(use-package simple-httpd
  :defer 4
  :custom
  (httpd-root "/var/www/html"))

(use-package impatient-mode
  :after simple-httpd
  :hook ((web-mode . httpd-start)
         (web-mode . impatient-mode)
         (css-mode . httpd-start)))

(use-package smartparens :defer 2)

(use-package try :defer 5)

(use-package undo-tree
  :diminish
  :bind ("C--" . undo-tree-redo)
  :init (global-undo-tree-mode)
  :custom
  (undo-tree-visualizer-timestamps t)
  (undo-tree-visualizer-diff t))
