config.org
** =web-beautify=

A formatting package of HTML, CSS and JavaScript/JSON for Emacs. It uses the
command-line/node.js javascript formatter from http://jsbeautifier.org/ to
format whole html, css, js or json files, or region.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package web-beautify
    :disabled
    :config
    (eval-after-load 'js2-mode
      '(add-hook 'js2-mode-hook
                 (lambda ()
                   (add-hook 'before-save-hook 'web-beautify-js-buffer t t))))

    (eval-after-load 'json-mode
      '(add-hook 'json-mode-hook
                 (lambda ()
                   (add-hook 'before-save-hook 'web-beautify-js-buffer t t))))

    (eval-after-load 'sgml-mode
      '(add-hook 'html-mode-hook
                 (lambda ()
                   (add-hook 'before-save-hook 'web-beautify-html-buffer t t))))

    (eval-after-load 'web-mode
      '(add-hook 'web-mode-hook
                 (lambda ()
                   (add-hook 'before-save-hook 'web-beautify-html-buffer t t))))

    (eval-after-load 'css-mode
      '(add-hook 'css-mode-hook
                 (lambda ()
                   (add-hook 'before-save-hook 'web-beautify-css-buffer t t)))))
#+END_SRC

If you plan to use it, don’t forget installing it via =npm=

#+BEGIN_SRC bash :tangle yes
  sudo npm install -g js-beautify
#+END_SRC

** =web-mode=

An autonomous emacs major-mode for editing web templates.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package web-mode
    :commands web-mode
    :hook ((css-mode web-mode) . rainbow-mode)
    :config
    (add-to-list 'auto-mode-alist '("\\.blade\\.php\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.php$" . my/php-setup))
    (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.hbs\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode)))
#+END_SRC

** =key-chord=

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package key-chord
    :commands key-chord-mord)
#+END_SRC

** =winner=

Global minor mode. When activated, it allows you to “undo”
(and “redo”) changes in the window configuration.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package winner :defer 5)
#+END_SRC

** =yasnippet=

YASnippet is a template system for Emacs. It allows you to type an
abbreviation and automatically expand it into function templates.

Very useful when you need to work with some boilerplatey languages like Java.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package yasnippet
    :defer 2
    :diminish yas-minor-mode
    :bind ("C-c i" . yas-insert-snippet)
    :init
    (yas-global-mode t)
    (add-to-list 'yas-snippet-dirs "~/.emacs.d/snippets")
    :custom
    (yas-snippet-dirs '("~/.emacs.d/snippets"))
    (yas-installed-snippets-dir "~/.emacs.d/snippets"))
#+END_SRC
